[
    {
        "date": "2016-03-14",
        "title": "Homestead - Block Time Decrease",
        "short_title": "Homestead",
        "description": "Homestead was Ethereum’s first major upgrade after the initial launch. It introduced several protocol changes to improve network stability, leading to a slight reduction in block times.",
        "source": "https://blog.ethereum.org/2016/02/29/homestead-release/"
    },
    {
        "date": "2016-09-22",
        "title": "DDOS",
        "short_title": "DDOS",
        "description": "A series of Denial-of-Service (DDoS) attacks targeted the Ethereum network, exploiting a vulnerability to overwhelm the nodes. This led to a temporary increase in block time and prompted several emergency fixes and optimizations, such as hard forks at blocks 2,463,000 and 2,675,000.",
        "source": "https://blog.ethereum.org/2016/10/04/in-depth-overview-of-the-recent-attacks/"
    },
    {
        "date": "2017-06-01",
        "title": "Difficulty Bomb Activates",
        "short_title": "Difficulty Bomb",
        "description": "The Difficulty Bomb was introduced to gradually increase the difficulty of mining, making blocks harder to find over time and encouraging the transition to Proof of Stake (PoS). It initially started affecting block times noticeably in mid-2017 but has been delayed multiple times in subsequent upgrades.",
        "source": "https://ethereum.org/en/developers/docs/consensus-mechanisms/pow/difficulty-bomb/"
    },
    {
        "date": "2017-10-16",
        "title": "Byzantium - Reward Drop and Bomb Delay",
        "short_title": "Byzantium",
        "description": "Byzantium introduced several Ethereum Improvement Proposals (EIPs), including a reduction of block rewards from 5 ETH to 3 ETH. The fork also delayed the Difficulty Bomb by approximately one year.",
        "source": "https://blog.ethereum.org/2017/10/12/byzantium-hf-announcement/"
    },
    {
        "date": "2019-02-28",
        "title": "Constantinople",
        "short_title": "Constantinople",
        "description": "This upgrade included various improvements like cheaper execution costs for some operations and a reduction in the block reward from 3 ETH to 2 ETH. It also included another delay of the Difficulty Bomb to maintain a reasonable block time.",
        "source": "https://blog.ethereum.org/2019/02/22/ethereum-constantinople-st-petersburg-upgrade-announcement/"
    },
    {
        "date": "2020-01-01",
        "title": "Muir Glacier - Difficulty Bomb",
        "short_title": "Muir Glacier",
        "description": "On January 1, 2020, Ethereum saw the activation of the Muir Glacier upgrade, which introduced an adjustment to the \"difficulty bomb.\" This \"bomb\" is a feature of Ethereum designed to make mining progressively harder, eventually pushing the network toward the anticipated transition from Proof of Work (PoW) to Proof of Stake (PoS) through Ethereum 2.0.\n\nThe Muir Glacier upgrade delayed the difficulty bomb by around 4 million blocks (about 611 days) because Ethereum 2.0 development was progressing slower than expected. This delay ensured that the network would continue to operate smoothly and prevented mining from becoming too difficult too quickly.",
        "source": "- Source = Lorenz growthepie"
    },
    {
        "date": "2020-12-01",
        "title": "Serenity Phase 0",
        "short_title": "Beacon Chain",
        "description": "Serenity Phase 0 - Also known as the Beacon Chain launch, Phase 0 marked the initial stage of Ethereum 2.0’s transition to PoS. It introduced the Beacon Chain, a separate network running in parallel to Ethereum's Proof-of-Work (PoW) chain, laying the groundwork for the eventual merge.",
        "source": "https://blog.ethereum.org/2020/12/01/eth2-quick-update-no-21-beacon-chain-is-live/"
    },
    {
        "date": "2021-08-06",
        "title": "London Burn EIP-1559",
        "short_title": "Burn EIP-1559",
        "description": "The London hard fork, introduced EIP-1559, which fundamentally altered Ethereum’s fee structure. This change started burning a portion of the transaction fees (base fees) instead of paying them to miners. As a result, it created a deflationary pressure on Ethereum’s supply, reducing the rate at which new ETH enters circulation",
        "source": "https://decrypt.co/collections/ethereum-london-hard-fork-eip-1559"
    },
    {
        "date": "2022-09-15",
        "title": "The Merge",
        "short_title": "The Merge",
        "description": "Ethereum transitioned from PoW to PoS by merging the main Ethereum chain with the Beacon Chain. This event permanently reduced the ETH issuance rate by approximately 90%, significantly impacting the circulating supply and overall network security.",
        "source": "https://blog.ethereum.org/2022/09/15/ethereum-mainnet-merge-successful/"
    }
]